Autodesk.Revit.DB.LabelType.TotalLength
the total length of the dimension

Autodesk.Revit.DB.LabelType.LengthOfSegment
the length of segment of the dimension

Autodesk.Revit.DB.LabelType.NumberOfSegments
the number of segments of the dimension

Autodesk.Revit.DB.LabelType.NumberOfWitnessLines
the number of witness lines of the dimension